app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."pinned" = TRUE
---
  def pinned
    @notes = Note.where(pinned: true)

INSERT INTO "notes" ("title", "body", "created_at", "updated_at", "pinned") VALUES ('Tryout', 'hbinf', '2025-07-13 00:34:23.579381', '2025-07-13 00:34:23.579381', NULL) RETURNING "id"
---
  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save

UPDATE "notes" SET "updated_at" = '2025-07-13 22:39:05.549557', "pinned" = FALSE WHERE "notes"."id" = 5
---
  def update
    respond_to do |format|
      if @note.update(note_params)

SELECT "notes".* FROM "notes" WHERE "notes"."id" = 1 LIMIT 1
UPDATE "notes" SET "updated_at" = '2025-07-14 00:43:33.441571', "pinned" = FALSE WHERE "notes"."id" = 4
---
  def toggle_pin
    @note = Note.find(params[:id])
    @note.update(pinned: !@note.pinned)

SELECT "notes".* FROM "notes" WHERE "notes"."id" = 5 LIMIT 1
---
    def set_note
      @note = Note.find(params.expect(:id))